[
    {
        "id": "9781617292576",
        "title": "Node.js in Action",
        "author": "Alex Young, Bradley Meck, and Mike Cantelon",
        "publisher": "Manning",
        "description": "Node.js in Action, Second Edition is a thoroughly revised product based on the best-selling first edition. It starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications.",
        "year": 2017,
        "price": 24.99,
        "count": 10
    },
    {
        "id": "9781617294723",
        "title": "Serverless Applications with Node.js",
        "author": "Slobodan Stojanović and Aleksandar Simović",
        "publisher": "Manning",
        "description": "Serverless Applications with Node.js walks you through building serverless apps on AWS using JavaScript. Inside, you'll discover what Claudia.js brings to the table as you build and deploy a scalable event-based serverless application, based around a pizzeria that’s fully integrated with AWS services, including Lambda and API Gateway. Each chapter is filled with exercises, examples, tips, and more to make sure you’re ready to bring what you’ve learned into your own work.",
        "year": 2019,
        "price": 23.39,
        "count": 12
    },
    {
        "id": "9781617293719",
        "title": "AWS Lambda in Action",
        "author": "Danilo Poccia",
        "publisher": "Manning",
        "description": "AWS Lambda in Action is an example-driven tutorial that teaches you how to build applications that use an event-driven approach on the back end.",
        "year": 2016,
        "price": 24.99,
        "count": 8
    },
    {
        "id": "9781617297335",
        "title": "AWS Security",
        "author": "Dylan Shields",
        "publisher": "Manning",
        "description": "AWS Security is an invaluable guide that you’ll want to have on hand when you’re facing any cloud security problem. With a cookproduct-style delivery, it’s filled with well-documented examples and procedures you can apply to common AWS security issues. This product covers best practices for access policies, data protection, auditing, continuous monitoring, and incident response. You’ll also explore several deliberately insecure applications, including a social media site and a mobile app, learning the exploits and vulnerabilities commonly used to attack them and the security practices to counter those attacks. With this practical primer, you’ll be well prepared to evaluate your system’s security, detect threats, and respond with confidence.",
        "year": 2020,
        "price": 24.99,
        "count": 5
    }
]